In [3]:
import pandas as pd
import scholarly

In [6]:
df = pd.read_csv('../data/math_geneology_final.csv')

In [7]:
df.head()

,Unnamed: 0,id,student_id,student_name,student_school,student_year,student_descendants,advisor_name,advisor_school,advisor_year
0,0,233136,233138,"Mogstad, Magne",Universitetet i Oslo,2008,1.0,"Aaberge, Rolf",Universitetet i Oslo,1976
1,1,13670,106100,"Anagnostakis, Christopher",Yale University,1984,NaN,"Aaboe, Asger",Brown University,1957
2,2,13670,122878,"Britton, John",Yale University,1966,NaN,"Aaboe, Asger",Brown University,1957
3,3,13670,122880,"Slotsky, Alice",Yale University,1992,1.0,"Aaboe, Asger",Brown University,1957
4,4,13670,122881,"Swerdlow, Noel",Yale University,1968,NaN,"Aaboe, Asger",Brown University,1957

In [10]:
df.query('advisor_name == "Mogstad, Magne"')

,Unnamed: 0,id,student_id,student_name,student_school,student_year,student_descendants,advisor_name,advisor_school,advisor_year
162003,162003,233138,234953,"Mountjoy, Jack",The University of Chicago,2018,NaN,"Mogstad, Magne",Universitetet i Oslo,2008

In [23]:
search_res = scholarly.search_author('Britton, John')

In [24]:
print(next(search_res))

{'_filled': False,
 'affiliation': 'Professor Nottingham',
 'citedby': 25039,
 'email': '@nottingham.ac.uk',
 'id': 'UK9ETCcAAAAJ',
 'interests': ['epidemiology smoking  tobacco respiratory'],
 'name': 'John Britton',
 'url_picture': 'https://scholar.google.com/citations?view_op=medium_photo&user=UK9ETCcAAAAJ'}